Repository: dianepretty/Blood_donation_app
Catalog: lib/l10n/app_*.arb
Languages: rw

# appTitle
source: Blood Donation App
rw: Porogaramu yo Gutanga Amaraso

source: Settings
rw: Igenamiterere

source: Language
rw: Ururimi

source: Security
rw: Umutekano

source: Change password
rw: Hindura ijambo banga

# lastChanged
source: Last changed {days} days ago
rw: Byahindutse iminsi {days} ishize

# twoFactorAuth
source: Two-factor authentication
rw: Ubushingantaha bubiri

source: Recommended
rw: Bishishikariza

source: App Information
rw: Amakuru ya Porogaramu

source: App Version
rw: Verisiyo ya Porogaramu

source: Last Updated
rw: Byahindutse vuba

source: Other
rw: Ibindi

source: Privacy policy
rw: Politiki y'ibanga

# privacyPolicyDesc
source: Learn how we handle your data.
rw: Menya uko dutunganya amakuru yawe.

source: Terms of service
rw: Amabwiriza ya Serivisi

# termsOfServiceDesc
source: Review our service agreement.
rw: Reba amasezerano yacu ya serivisi.

source: Logout
rw: Sohoka

# logoutConfirm
source: Are you sure you want to logout?
rw: Uzi neza ko ushaka gusohoka?

source: Cancel
rw: Hagarika

source: Confirm
rw: Emeza

source: Save
rw: Bika

source: Loading...
rw: Birakora...

source: Error
rw: Ikibazo

source: Success
rw: Byagenze neza

source: Home
rw: Ahabanza

source: Events
rw: Ibikorwa

source: Appointments
rw: Igihe

source: Profile
rw: Imyirondoro

source: History
rw: Amateka

source: Help & Support
rw: Ubufasha n'Inkunga

source: Donation History
rw: Amateka yo Gutanga

source: Create Event
rw: Kora Ikiborwa

source: Edit Event
rw: Hindura Ikiborwa

source: View Event
rw: Reba Ikiborwa

source: Event Name
rw: Izina ry'Ikiborwa

# eventLocation
source: Location
rw: Aho Ikiborwa

# eventDate
source: Date
rw: Itariki y'Ikiborwa

# eventTime
source: Time
rw: Igihe cy'Ikiborwa

# eventDescription
source: Description
rw: Ibisobanura by'Ikiborwa

# eventStatus
source: Status
rw: Imiterere y'Ikiborwa

source: Upcoming
rw: Biraza

source: Active
rw: Bikora

source: Completed
rw: Byarangiye

source: Book Appointment
rw: Fata Igihe

source: Appointment Date
rw: Itariki y'Igihe

source: Appointment Time
rw: Igihe cy'Igihe

source: Appointment Type
rw: Ubwoko bw'Igihe

source: Blood Donation
rw: Gutanga Amaraso

source: Consultation
rw: Inama

source: Login
rw: Injira

source: Register
rw: Iyandikishe

source: Email
rw: Imeyili

source: Password
rw: Ijambo banga

source: Confirm Password
rw: Emeza ijambo banga

source: Full Name
rw: Amazina yose

source: Phone Number
rw: Telefoni

source: District
rw: Akarere

source: Role
rw: Umwanya

source: Volunteer
rw: Umwishingizi

source: Hospital Admin
rw: Umuyobozi w'Ibitaro

source: Welcome
rw: Murakaza neza

source: Dashboard
rw: Ikibaho

source: Overview
rw: Inyandiko

source: Upcoming Events
rw: Ibikorwa Biraza

# pendingAppointments
source: Pending Appointment Requests
rw: Igihe Rihari

source: Notifications
rw: Amatangazo

source: Notifications coming soon!
rw: Amatangazo aza vuba!

source: User Name
rw: Izina rya Koresha

# userEmail
source: user@example.com
rw: koresha@urugero.com

source: Select Language
rw: Hitamo Ururimi

source: English
rw: Icyongereza

source: French
rw: Igifaransa

source: Kinyarwanda
rw: Ikinyarwanda

# languageChanged
source: Language changed successfully
rw: Ururimi rwahindutse neza

# pleaseLogin
source: Please log in to view events
rw: Nyamuneka winjire kugira ngo ubone ibikorwa

# noEvents
source: No events found
rw: Nta bikorwa byabonetse

# noAppointments
source: No appointments found
rw: Nta gihe byabonetse

source: Create New Event
rw: Kora Ikiborwa Gishya

source: Edit Event Details
rw: Hindura Ibisobanura by'Ikiborwa

# eventCreated
source: Event created successfully!
rw: Ikiborwa cyakozwe neza!

# eventUpdated
source: Event updated successfully!
rw: Ikiborwa cyahindutse neza!

# eventDeleted
source: Event deleted successfully!
rw: Ikiborwa cyasibwe neza!

# failedToCreateEvent
source: Failed to create event. Please try again.
rw: Ikiborwa nticyakoze. Nyamuneka ongera ugerageze.

# failedToUpdateEvent
source: Failed to update event. Please try again.
rw: Ikiborwa nticyahindutse. Nyamuneka ongera ugerageze.

# failedToDeleteEvent
source: Failed to delete event. Please try again.
rw: Ikiborwa nticyasibwe. Nyamuneka ongera ugerageze.

source: View Details
rw: Reba Ibisobanura

source: Enter event name
rw: Andika izina r'ikiborwa

source: Enter location
rw: Andika aho

# enterDescription
source: Enter event description
rw: Andika ibisobanura by'ikiborwa

source: Select Date
rw: Hitamo Itariki

source: Select Time
rw: Hitamo Igihe

source: From Time
rw: Kuva Igihe

source: To Time
rw: Kugeza Igihe

# invalidTime
source: End time must be after start time
rw: Igihe cyo kurangira kigomba kuba nyuma y'igihe cyo gutangira

source: Required
rw: Bikenewe

source: Optional
rw: Bishobora kuba

source: Blood Type
rw: Ubwoko bw'Amaraso

source: Blood Group
rw: Ubwoko bw'Amaraso

source: Donor
rw: Umutanga

source: Recipient
rw: Uwakira

source: Hospital
rw: Ibitaro

source: Clinic
rw: Kliniki

source: Medical Center
rw: Icyumba cy'Ubuvuzi

source: Health Center
rw: Icyumba cy'Ubuzima

source: Emergency
rw: Ubutabazi

source: Urgent
rw: Bihutirwa

source: Critical
rw: Bikenewe

source: Stable
rw: Bihagaze

source: Unstable
rw: Bitarahagaze

source: Healthy
rw: Ufite ubuzima

source: Sick
rw: Urumye

source: Recovered
rw: Warwaye

source: Healing
rw: Gukira

source: Treatment
rw: Gukingira

source: Medication
rw: Imiti

source: Prescription
rw: Inyongera

source: Diagnosis
rw: Gusuzuma

source: Symptoms
rw: Ibimenyetso

source: Condition
rw: Imiterere

source: Disease
rw: Indwara

source: Infection
rw: Gutwara

source: Injury
rw: Kuvunika

source: Wound
rw: Icaru

source: Pain
rw: Ububabare

source: Fever
rw: Umuriro

source: Temperature
rw: Ubushyuhe

source: Pressure
rw: Intambike

source: Heart Rate
rw: Umuvuduko w'Umutima

source: Blood Pressure
rw: Intambike y'Amaraso

source: Weight
rw: Uburemere

source: Height
rw: Uburebure

source: Age
rw: Imyaka

source: Gender
rw: Ubwoko

source: Male
rw: Umugabo

source: Female
rw: Umugore

source: Contact
rw: Twandikire

source: Address
rw: Aderesi

source: City
rw: Umujyi

source: Country
rw: Igihugu

source: Postal Code
rw: Kode y'Posita

source: Phone
rw: Telefoni

source: Mobile
rw: Telefoni y'Intambwe

source: Landline
rw: Telefoni y'Ubutaka

source: Emergency Contact
rw: Twandikire rw'Ubutabazi

source: Relationship
rw: Isano

source: Spouse
rw: Umugabo/Umugore

source: Parent
rw: Umubyeyi

source: Child
rw: Umwana

source: Sibling
rw: Muvandimwe

source: Friend
rw: Inshuti

source: Colleague
rw: Umukoranyi

source: Neighbor
rw: Umuturanyi

source: Welcome to Blood Donation
rw: Murakaza neza ku Gutanga Amaraso

source: Save Changes
rw: Bika Ibihindutse

source: Delete
rw: Siba

source: Edit
rw: Hindura

source: Create
rw: Kora

source: Update
rw: Hindura

source: Back
rw: Subira Inyuma

source: Next
rw: Ibikurikira

source: Previous
rw: Ibihari

source: Submit
rw: Ohereza

source: Reset
rw: Tangira

source: Search
rw: Shakisha

source: Filter
rw: Shungura

source: Sort
rw: Shungura

source: Refresh
rw: Hindura

source: Close
rw: Funga

source: Open
rw: Fungura

source: Yes
rw: Yego

source: No
rw: Oya

source: OK
rw: Sawa

source: Done
rw: Byarangiye

source: Skip
rw: Siga

# continueAction
source: Continue
rw: Komeza

# finishAction
source: Finish
rw: Rangiza

# startAction
source: Start
rw: Tangira

# stopAction
source: Stop
rw: Hagarika

# pauseAction
source: Pause
rw: Hagarika

# resumeAction
source: Resume
rw: Komeza

# retryAction
source: Retry
rw: Ongera ugerageze

# abortAction
source: Abort
rw: Hagarika

source: Pending
rw: Bihari

source: Approved
rw: Byemewe

source: Rejected
rw: Byanze

source: In Progress
rw: Bikora

source: Scheduled
rw: Byagenwe

source: Cancelled
rw: Byahagaritswe

source: Expired
rw: Byarangiye

source: Inactive
rw: Ntibikora

source: Enabled
rw: Bikora

source: Disabled
rw: Ntibikora

source: Visible
rw: Biboneka

source: Hidden
rw: Bibujwe

source: Public
rw: Biboneka

source: Private
rw: Bibujwe

source: Draft
rw: Ibintu

source: Published
rw: Byasohowe

source: Archived
rw: Byabikwa

source: Deleted
rw: Byasibwe

source: Restored
rw: Byasubijwe

source: Moved
rw: Byahindutse

source: Copied
rw: Byakopiwe

source: Shared
rw: Byagabanyijwe

source: Unshared
rw: Ntibyagabanyijwe

source: Locked
rw: Byafungwe

source: Unlocked
rw: Byafunguriwe

source: Verified
rw: Byasuzumwe

source: Unverified
rw: Ntibyasuzumwe

source: Valid
rw: Bikora

source: Invalid
rw: Ntibikora

source: Successful
rw: Byagenze neza

source: Failed
rw: Byanze

source: Warning
rw: Iburira

# info
source: Information
rw: Amakuru

source: Debug
rw: Gusuzuma

source: Trace
rw: Kurikirana

source: Fatal
rw: By'aga

source: High
rw: Hejuru

source: Medium
rw: Hagati

source: Low
rw: Hasi

source: None
rw: Nta na kimwe

source: All
rw: Byose

source: Some
rw: Bimwe

source: Few
rw: Bike

source: Many
rw: Benshi

source: Most
rw: Benshi

source: Least
rw: Bike

source: Best
rw: Byiza

source: Worst
rw: Bibi

source: Better
rw: Byiza

source: Worse
rw: Bibi

source: Same
rw: Kimwe

source: Different
rw: Bitandukanye

source: Similar
rw: Bisa

source: Unique
rw: Bihari

source: Common
rw: Bisanzwe

source: Rare
rw: Bike

source: Frequent
rw: Benshi

source: Occasional
rw: Bike

source: Regular
rw: Bisanzwe

source: Irregular
rw: Ntibisanzwe

source: Normal
rw: Bisanzwe

source: Abnormal
rw: Ntibisanzwe

# standardType
source: Standard
rw: Bisanzwe

# customType
source: Custom
rw: Bihari

# defaultValue
source: Default
rw: Bisanzwe

# automaticMode
source: Automatic
rw: Bikora

# manualMode
source: Manual
rw: Bikora
